{
  "puzzle_num": 6,
  "puzzle_location": "graveyard",
  "key_item": ["grave", "oval tombstone"],
  "key_command": ["dig", "uncover"],
  "key_item2": ["shovel"],
  "solved_description": "You pull the lid off of the coffin. You have had a growing sense of dread that seems to be peaking. The body inside the coffin has withered away with age. The skin is brown and mummified, but the face still looks a little too familiar. And those clothes... the shirt and the pants are uncanny, but those shoes, those were your favorite shoes. In fact...you're wearing them now. You're wearing this entire outfit right now. And that face…it's not just familiar …it's your own. You reach out to touch it with mute horror and the moment you make contact, memories come flooding back.\n\nWhile Eliza is bustling to prepare dinner for your weekly dinner party with John and Martha, you are in the kitchen, finally getting around to reading a letter from Dr. Peters.\n\nDear Samuel,\nI have never written a more difficult letter. A few weeks ago, Mrs. Eliza Rothester approached me and asked if I would assist her in obtaining a new drug by the name of thallium. Although I found the amount she was purchasing suspicious, I never questioned it, and I was paid well for my discretion. I condescended to think that I knew Eliza well and that she would  never think to hurt another. After our last checkup, it has become apparent to me that I was wrong. I do not know how to tell a person what I must now tell you, so I will just say it plainly;  I do not believe that you are ill, Mr. Rothester, I believe you are being poisoned. For the part I have played in this tragedy-I will spend the rest of my life in repentance. She told me it was for the rats.\n-Dr. Peters.\n\nYou remember putting down the letter and looking towards Eliza, who was still busy preparing dinner. She doesn't notice you staring at first, but when she does, her eyes dart from your expression to the piece of paper in your hand, and she immediately lunges for the knife block. You turn to run. You make  it all the way to the foyer, but your hands are shaking so badly that you are having trouble undoing the numerous, bulky locks chaining the door shut. Two locks down, only one to go and… A sharp, shooting pain pierces through you. You look down to see the tip of a knife protruding from your stomach. You immediately become woozy and fall to the floor. You can feel your own blood spreading as Eliza looks down at you. She is growing hazier as your vision starts to fade, but you could swear that in those last few moments, she was smiling.\n.\n...\n.....\nYou yank your hand away from the body with a gasp as it fully hits you. You  are Samuel Rothester; this is your body you are looking at. Eliza killed you. You are dead. Everything feels surreal and dizzy. Your vision again grows dark as you pass out.\n.....\n...\n.\n\nYou wake up in a cold sweat. You reach over to grab your watch, but it's not on your nightside table. Your nightside table isn't there either. Come to think of it, you're not on your bed; where are you? You stand up and look around at your surroundings: you seem to be in the foyer of some mysterious mansion...\n.\n...\n.....\n",
  "item_given": ""
}
